"""
升职加薪
"""

# 定义一个字典：有如下员工信息
salary_dict = {
    "王力宏":{"部门":"科技部","工资":3000,"级别":1},
    "周杰伦":{"部门":"市场部","工资":5000,"级别":2},
    "林俊杰":{"部门":"市场部","工资":7000,"级别":3},
    "张学友":{"部门":"科技部","工资":4000,"级别":1},
    "刘德华":{"部门":"市场部","工资":6000,"级别":2},
}
print(f"全体员工当前信息如下：{salary_dict}")

# 通过for循环，对所有级别为1的员工，级别上升1级，薪水增加1000元
for key in salary_dict:
    if salary_dict[key]["级别"] == 1:
        salary_dict[key]["级别"] = 2
        salary_dict[key]["工资"] += 1000
print(f"全体员工级别为1的员工完成升职加薪操作，操作后，{salary_dict}")

